# Groupby Function

Groupby is one of the most important and key functionality in pandas. It allows us to group data together, call aggregate functions and combine the results in three steps *split-apply-combine*: <br>
Before we move on to the hands-on, let's try to understand how this split-apply-combine work, using a data in different colours!

* **Split:** In this process, data contained in a pandas object (e.g. Series, DataFrame) is split into groups based on one or more keys that we provide. The splitting is performed on a particular axis of an object. For example, a DataFrame can be grouped on its rows (axis=0) or its columns (axis=1). <br>
* **apply:** Once splitting is done, a function is applied to all groups independently, producing a new value.
* **combine:** Finally, the results of all those functions applications are combined into a resultant object. The form of the resulting object will usually depend on what's being done to the data.<br>

In [1]:
import pandas as pd

Let's create a dictionary and convert that into pandas dataframe

In [2]:
# Create a dataframe
data = {'Store':['Walmart','Walmart','Costco','Costco','Target','Target'],
       'Customer':['Tim','Jermy','Mark','Denice','Ray','Sam'],
       'Sales':[150,200,550,90,430,120]}
df = pd.DataFrame(data)
df

     Store Customer  Sales
0  Walmart      Tim    150
1  Walmart    Jermy    200
2   Costco     Mark    550
3   Costco   Denice     90
4   Target      Ray    430
5   Target      Sam    120

In [6]:
df.Store.unique()

array(['Walmart', 'Costco', 'Target'], dtype=object)

In [7]:
df.Store.nunique()

3

In [8]:
df[['Store']].value_counts()

Store
Costco     2
Target     2
Walmart    2
dtype: int64

In [11]:
df.groupby("Store").max()

        Customer  Sales
Store
Costco      Mark    550
Target       Sam    430
Walmart      Tim    200

In [12]:
df.groupby("Store")[['Sales']].count()

         Sales
Store
Costco       2
Target       2
Walmart      2

In [14]:
by_store = df.groupby("Store")
by_store

Now, we have grouped data in "by_store" object, we can call aggregate method on this object.

In [15]:
sum1 = by_store.sum()
mean1 = by_store.mean()

In [18]:
sum1

         Sales
Store
Costco     640
Target     550
Walmart    350

In [19]:
mean1

         Sales
Store
Costco   320.0
Target   275.0
Walmart  175.0

In [14]:
# The steps above in a sinlge line code
df.groupby('Store').mean()

         Sales
Store
Costco   320.0
Target   275.0
Walmart  175.0

In [25]:
# In oneline code
df.groupby('Store').sum().loc[["Target","Walmart"]]

         Sales
Store
Target     550
Walmart    350

We can perform whole lots of aggregation operations on "by_store" object.

In [26]:
df

     Store Customer  Sales
0  Walmart      Tim    150
1  Walmart    Jermy    200
2   Costco     Mark    550
3   Costco   Denice     90
4   Target      Ray    430
5   Target      Sam    120

In [29]:
by_store.min()[['Sales']]

         Sales
Store
Costco      90
Target     120
Walmart    150

In [34]:
by_store.std()

              Sales
Store
Costco   325.269119
Target   219.203102
Walmart   35.355339

In [39]:
df.groupby('Store')[['Customer']].count()

         Customer
Store
Costco          2
Target          2
Walmart         2

In [40]:
df.groupby('Store')[['Customer']].count().loc[['Walmart']]

         Customer
Store
Walmart         2

In [41]:
by_store.count()[["Customer"]].loc[["Target"]]

        Customer
Store
Target         2

In [42]:
df

     Store Customer  Sales
0  Walmart      Tim    150
1  Walmart    Jermy    200
2   Costco     Mark    550
3   Costco   Denice     90
4   Target      Ray    430
5   Target      Sam    120

describe is a useful method, that gives a bunch of useful information, such as, mean, min, quartile values etc for each company.

In [44]:
by_store.describe()

        Sales
        count   mean         std    min    25%    50%    75%    max
Store
Costco    2.0  320.0  325.269119   90.0  205.0  320.0  435.0  550.0
Target    2.0  275.0  219.203102  120.0  197.5  275.0  352.5  430.0
Walmart   2.0  175.0   35.355339  150.0  162.5  175.0  187.5  200.0

Let's use `transpose()` after describe so that the output looks good!

In [20]:
by_store.describe().transpose()

Store            Costco      Target     Walmart
Sales count    2.000000    2.000000    2.000000
      mean   320.000000  275.000000  175.000000
      std    325.269119  219.203102   35.355339
      min     90.000000  120.000000  150.000000
      25%    205.000000  197.500000  162.500000
      50%    320.000000  275.000000  175.000000
      75%    435.000000  352.500000  187.500000
      max    550.000000  430.000000  200.000000